Integračný manuál eFORM/Externá zbernica (USR)/GetSubscriberSearchCriteria/EFORM_GETSUBSCRIBERSEARCHCRITERIA_SOAP_V_1_0__REQ.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header>
		<Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://schemas.gov.sk/ServiceBus/service/1.0/IServiceBus/CallService</Action>
		<ActivityId CorrelationId="684a607e-7553-475a-bf93-f1aba4922f8e" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">277b7aec-29cf-435a-a31e-3c9bf8dee27c</ActivityId>
		<VsDebuggerCausalityData xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink"/>
	</s:Header>
	<s:Body>
		<CallService xmlns="http://schemas.gov.sk/ServiceBus/service/1.0">
			<serviceClass>EFORM_GETSUBSCRIBERSEARCHCRITERIA_SOAP_V_1_0</serviceClass>
			<serviceParameter xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:d4p2="http://schemas.gov.sk/ServiceBusServiceProvider/Ness/eFormProvider/1.0" i:type="d4p2:GetSubscriberSearchCriteriaReq">
				<d4p2:SubscribedGestor>Testcase.TS</d4p2:SubscribedGestor>
				<d4p2:SubscribedPublisher>UPVS</d4p2:SubscribedPublisher>
			</serviceParameter>
		</CallService>
	</s:Body>
</s:Envelope>
